;菜单项名|热键|菜单项图标|备注|功能类型|功能参数
;如果开头带-就是子菜单名，多少个-表示层级，格式为 -子菜单名|热键|子菜单图标|备注
;单独只有-的行则是分隔线，注意-的个数，表示层级
-置顶/置底|file
	;win_SetWindowTop_xy(Action := "Toggle", ShowBorder := True, BorderColor := "Red", Thickness := 3, Alpha := 255, WinAlpha := "", WinTitle := "A")
	置顶/取消_红外框|RAlt & F9|||1|win_SetWindowTop_xy("Toggle", True, "FF0000", 4, 255,"" , "A")
	--
	置顶/取消||||1|win_SetWindowTop_xy("Toggle", False,,,,"" , "A")
	置顶||||1|win_SetWindowTop_xy("On", False,,,,"" , "A")
	取消置顶||||1|win_SetWindowTop_xy("Off", False,,,,"" , "A")
	--
	置底/取消||||1|Win_Bottom_xy("Toggle", "A")
	置底||||1|Win_Bottom_xy("On", "A")
	取消置底||||1|Win_Bottom_xy("Off", "A")
	--
	;#[窗口置顶时设置透明，第二次还原]
	置顶时透明/取消||||1|win_SetWindowTop_xy("Toggle", False,,,,"180","A")
-窗口操作
	卷起窗口||||1|ToggleRollUp_xy("A", 25)
	--
	更改窗口图标||||3|GhostSnap_ChangeWindowTitleAndIcon.ahk "A" 2
	更改窗口标题||||3|GhostSnap_ChangeWindowTitleAndIcon.ahk "A" 1
	--
	窗口最大化||||1|win_maximize_xy("A")
	窗口最大化或取消||||1|win_toggle_maximize_xy("A")
	--
	窗口最小化||||1|win_minimize_xy("A")
	最小化其他窗口||||1|ManageOtherWindows_xy("A","Minimize")
	--
	当前窗口关闭||||1|win_close_xy("A")
	关闭其他窗口||||1|ManageOtherWindows_xy("A","Close")
	--
	结束窗口进程||||1|win_kill_zz("A")
	结束窗口进程PID||||1|win_kill_pid_zz("A")
	结束窗口程序所有进程||||1|win_kill_all_xy("A")
	--
	重启窗口进程||||1|win_restart_xy("A")
	--
	窗口隐藏到托盘||||3|GhostSnap_HideWindowToTray.ahk "A"
	--窗口音量控制
		窗口音量+5
		窗口音量-5
		窗口静音/恢复
	--按钮相关
		;SetWindowFeatures_xy(WinTitle, p_Min:="", p_Max:="", p_Resize:="", p_Move:="", p_Close:="")
		; 参数顺序: (窗口标题, 最小化, 最大化, 调整大小, 移动, 关闭按钮)
		; 可选值: "On" (开启), "Off" (关闭), "Toggle" (自动切换), "" (留空表示不修改)
		禁用/启用[关闭按钮]||||1|SetWindowFeatures_xy("A", "", "", "", "", "Toggle")
		禁用/启用[最小化按钮]||||1|SetWindowFeatures_xy("A", "Toggle", "", "", "", "")
		禁用/启用[最大化按钮]||||1|SetWindowFeatures_xy("A", "", "Toggle", "", "", "")
	--优先级
		Low(低)||||1|win_priority_zz("A","Low")
		BelowNormal(低于标准)||||1|win_priority_zz("A","BelowNormal")
		Normal(普通)||||1|win_priority_zz("A","Normal")
		AboveNormal(高于标准)||||1|win_priority_zz("A","AboveNormal")
		High(高)||||1|win_priority_zz("A","High")
		Realtime(实时)||||1|win_priority_zz("A","Realtime")
	--滚动条操作
		;#用于含垂直\水平滚动条的控件
		向下滚动||||1|move_Scroll_Bar("0x0115","1","A")
		向上滚动||||1|move_Scroll_Bar("0x0115","0","A")
		向右滚动||||1|move_Scroll_Bar("0x0114","1","A")
		向左滚动||||1|move_Scroll_Bar("0x0114","0","A")
-大小调整
	;#调整当前活动窗口大小，等比例缩小和放大[原来窗口的多少倍]
	窗口等比例缩小||||1|ScaleWindow("A", 0.9)
	窗口等比例增大||||1|ScaleWindow("A", 1.1)
	--
	窗口占比0.5x0.5||||1|win_size_zz(A_ScreenWidth*0.5,A_ScreenHeight*0.5)
	窗口占比0.7x0.7||||1|win_size_zz(A_ScreenWidth*0.7,A_ScreenHeight*0.7)
	窗口占比0.8x0.8||||1|win_size_zz(A_ScreenWidth*0.8,A_ScreenHeight*0.8)
	窗口占比0.8x0.9||||1|win_size_zz(A_ScreenWidth*0.8,A_ScreenHeight*0.95)
	--
	禁用/启用窗口大小调整||||1|SetWindowFeatures_xy("A", "", "", "Toggle", "", "")
	||
	;#宽屏分辨率比例：16:9
	窗口320x180||||1|win_size_zz(320,180)
	窗口640x360||||1|win_size_zz(640,360)
	窗口960x540||||1|win_size_zz(960,540)
	窗口1280x720||||1|win_size_zz(1280,720)		
	窗口1366x768||||1|win_size_zz(1366,768)
	窗口1600x900||||1|win_size_zz(1600,900)
	窗口1920x1080||||1|win_size_zz(1920,1080)
	窗口2240x1260||||1|win_size_zz(2240,1260)
	窗口2560x1440||||1|win_size_zz(2560,1440)
	窗口2880x1620||||1|win_size_zz(2880,1620)
	窗口3200x1800||||1|win_size_zz(3200,1800)
	窗口3520x1980||||1|win_size_zz(3520,1980)
	窗口3840x2160||||1|win_size_zz(3840,2160)
	||
	;#大宽屏分辨率比例：16:10
	窗口320x200||||1|win_size_zz(320,200)
	窗口640x400||||1|win_size_zz(640,400)
	窗口720x450||||1|win_size_zz(720,450)
	窗口960x600||||1|win_size_zz(960,600)
	窗口1280x800||||1|win_size_zz(1280,800)
	窗口1440x900||||1|win_size_zz(1440,900)
	窗口1680x1050||||1|win_size_zz(1680,1050)
	窗口1920x1200||||1|win_size_zz(1920,1200)
	窗口2240x1400||||1|win_size_zz(2240,1400)
	窗口2560x1600||||1|win_size_zz(2560,1600)
	窗口3200x2000||||1|win_size_zz(3200,2000)
	--
	;#带鱼屏分辨率比例：21:9
	窗口2560x1080||||1|win_size_zz(2560,1080)
	窗口3440x1440||||1|win_size_zz(3440,1440)
	||
	;#分辨率比例：4:3
	窗口320x240||||1|win_size_zz(320,240)
	窗口640x480||||1|win_size_zz(640,480)
	窗口800x600||||1|win_size_zz(800,600)
	窗口960x720||||1|win_size_zz(960,720)
	窗口1024x768||||1|win_size_zz(1024,768)
	窗口1280x960||||1|win_size_zz(1280,960)
	窗口1400x1050||||1|win_size_zz(1400,1050)
	窗口1600x1200||||1|win_size_zz(1600,1200)
	窗口1920x1440||||1|win_size_zz(1920,1440)
	窗口2048x1536||||1|win_size_zz(2048,1536)
	窗口3200x2400||||1|win_size_zz(3200,2400)
-移动窗口
	左上角||||1|MoveWindow_xy("A","左上角")
	中间上侧||||1|MoveWindow_xy("A","中间上侧")
	右上角||||1|MoveWindow_xy("A","右上角")
	--
	中间左侧||||1|MoveWindow_xy("A","中间左侧")
	正中央||||1|MoveWindow_xy("A","正中央")
	中间右侧||||1|MoveWindow_xy("A","中间右侧")
	--
	左下角||||1|MoveWindow_xy("A","左下角")
	中间下侧||||1|MoveWindow_xy("A","中间下侧")
	右下角||||1|MoveWindow_xy("A","右下角")
	--
	水平居中||||1|MoveWindow_xy("A","水平居中")
	垂直居中||||1|MoveWindow_xy("A","垂直居中")
	--
	移动到显示器1||||1|MoveWindowToMonitor("A", 1)
	移动到显示器2||||1|MoveWindowToMonitor("A", 2)
	移动到显示器3||||1|MoveWindowToMonitor("A", 3)
	--
	禁用/启用窗口移动||||1|SetWindowFeatures_xy("A", "", "", "", "Toggle", "")
-大小调整并移动
	;#鼠标框选范围，并将窗口大小移动到鼠标框选的范围
	窗口[自定义框选大小]||||1|KuangXuan_xy("A")
	窗口居中1280x800||||1|win_move_size_zz((A_ScreenWidth-1280)/2,(A_ScreenHeight-800)/2,1280,800)
	窗口居中80%屏幕||||1|win_move_size_zz((A_ScreenWidth-A_ScreenWidth*0.8)/2,(A_ScreenHeight-A_ScreenHeight*0.8)/2,A_ScreenWidth*0.8,A_ScreenHeight*0.8)
	--
	窗口上半屏||||1|win_move_size_zz(0,0,A_ScreenWidth,A_ScreenHeight*0.5)
	窗口下半屏||||1|win_move_size_zz(0,A_ScreenHeight*0.5,A_ScreenWidth,A_ScreenHeight*0.5)
	窗口左半屏||||1|win_move_size_zz(0,0,A_ScreenWidth*0.5,A_ScreenHeight)
	窗口右半屏||||1|win_move_size_zz(A_ScreenWidth*0.5,0,A_ScreenWidth*0.5,A_ScreenHeight)
	--
	窗口屏幕左上角||||1|win_move_size_zz(0,0,A_ScreenWidth*0.5,A_ScreenHeight*0.5)
	窗口屏幕左下角||||1|win_move_size_zz(0,A_ScreenHeight-A_ScreenHeight*0.5,A_ScreenWidth*0.5,A_ScreenHeight*0.5)
	窗口屏幕右上角||||1|win_move_size_zz(A_ScreenWidth-A_ScreenWidth*0.5,0,A_ScreenWidth*0.5,A_ScreenHeight*0.5)
	窗口屏幕右下角||||1|win_move_size_zz(A_ScreenWidth-A_ScreenWidth*0.5,A_ScreenHeight-A_ScreenHeight*0.5,A_ScreenWidth*0.5,A_ScreenHeight*0.5)
-透明度调整
	窗口透明化-30||||1|win_transparency_zz(1,30)
	窗口不透明+30||||1|win_transparency_zz(0,30)
	取消透明||||1|win_transparency_zz(0,255)
-贴边隐藏
	上贴边隐藏||||1|ForceEdgeHide_xy("Top", "A")
	下贴边隐藏||||1|ForceEdgeHide_xy("Bottom", "A")
	左贴边隐藏||||1|ForceEdgeHide_xy("Left", "A")
	右贴边隐藏||||1|ForceEdgeHide_xy("Right", "A")
-复制信息
	复制窗口标题||||1|CopyWin("A","Title")
	复制窗口命令行||||1|CopyWin("A","commandline")
	复制完整程序路径||||1|CopyWin("A","exePath")
	复制窗口截图||||1|CopyActiveWindowGdip_xy("A")
-
打开窗口所在目录||||1|win_folder_zz("A")
;打开窗口所在目录[资管]||||1|win_folder_zz("A","explorer.exe","/select,")
;打开窗口所在目录[do]||||1|win_folder_zz("A",'"D:\软件\安装版\Directory Opus\dopusrt.exe"',"/acmd go OPENCONTAINER NEWTAB=findexisting path=")

;#当前打开的文档/文件，利用ev快速定位其所在路径
ev定位文档路径||||1|locationpath_xy("A","D:\RunAny\Everything\Everything.exe")
切换窗口||||1|SwitchWindowLogic_xy("A")
鼠标穿透||||1|win_clickthrough_xy("A")
隐藏||||1|win_hide_xy("A")
	